; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(on b1 b6)
(on b2 b10)
(on b3 b11)
(on b4 b3)
(on b5 b13)
(on b6 b7)
(on b7 b2)
(on b8 b12)
(on b9 b8)
(on b10 b5)
(ontable b11)
(on b12 b1)
(on b13 b4)
(clear b9)
)
(:goal
(and
(on b2 b13)
(on b3 b8)
(on b4 b11)
(on b5 b4)
(on b7 b12)
(on b9 b1)
(on b11 b2)
(on b12 b6)
(on b13 b3))
)
)

; plan
1. (move-b-to-t b9 b8)
   deleted: (on b9 b8)
   added: (ontable b9) (clear b8)
   goals met: 0 of 9
2. (move-b-to-t b8 b12)
   deleted: (on b8 b12)
   added: (ontable b8) (clear b12)
   goals met: 0 of 9
3. (move-b-to-b b12 b1 b8)
   deleted: (clear b8) (on b12 b1)
   added: (on b12 b8) (clear b1)
   goals met: 0 of 9
4. (move-b-to-t b1 b6)
   deleted: (on b1 b6)
   added: (ontable b1) (clear b6)
   goals met: 0 of 9
5. (move-b-to-t b6 b7)
   deleted: (on b6 b7)
   added: (ontable b6) (clear b7)
   goals met: 0 of 9
6. (move-b-to-b b12 b8 b6)
   deleted: (clear b6) (on b12 b8)
   added: (on b12 b6) (clear b8)
   goals met: 1 of 9
7. (move-b-to-b b7 b2 b12)
   deleted: (clear b12) (on b7 b2)
   added: (on b7 b12) (clear b2)
   goals met: 2 of 9
8. (move-b-to-b b2 b10 b9)
   deleted: (clear b9) (on b2 b10)
   added: (on b2 b9) (clear b10)
   goals met: 2 of 9
9. (move-b-to-t b10 b5)
   deleted: (on b10 b5)
   added: (ontable b10) (clear b5)
   goals met: 2 of 9
10. (move-b-to-b b5 b13 b7)
   deleted: (clear b7) (on b5 b13)
   added: (on b5 b7) (clear b13)
   goals met: 2 of 9
11. (move-b-to-b b13 b4 b10)
   deleted: (clear b10) (on b13 b4)
   added: (on b13 b10) (clear b4)
   goals met: 2 of 9
12. (move-b-to-b b4 b3 b1)
   deleted: (clear b1) (on b4 b3)
   added: (on b4 b1) (clear b3)
   goals met: 2 of 9
13. (move-b-to-b b3 b11 b8)
   deleted: (clear b8) (on b3 b11)
   added: (on b3 b8) (clear b11)
   goals met: 3 of 9
14. (move-b-to-b b13 b10 b3)
   deleted: (clear b3) (on b13 b10)
   added: (on b13 b3) (clear b10)
   goals met: 4 of 9
15. (move-b-to-b b2 b9 b13)
   deleted: (clear b13) (on b2 b9)
   added: (on b2 b13) (clear b9)
   goals met: 5 of 9
16. (move-t-to-b b11 b2)
   deleted: (clear b2) (ontable b11)
   added: (on b11 b2)
   goals met: 6 of 9
17. (move-b-to-b b4 b1 b11)
   deleted: (clear b11) (on b4 b1)
   added: (on b4 b11) (clear b1)
   goals met: 7 of 9
18. (move-b-to-b b5 b7 b4)
   deleted: (clear b4) (on b5 b7)
   added: (on b5 b4) (clear b7)
   goals met: 8 of 9
19. (move-t-to-b b9 b1)
   deleted: (clear b1) (ontable b9)
   added: (on b9 b1)
   goals met: 9 of 9
